In [29]:
import pandas as pd
import sqlite3
from pathlib import Path

RAW = Path("../data/raw")
DB_PATH = Path("../data/sqlite/retail.db")
DB_PATH.parent.mkdir(parents=True, exist_ok=True)

conn = sqlite3.connect(DB_PATH)

In [30]:
order_products = pd.read_csv(RAW / "retail_transactions.csv")

order_products.shape

(30, 10)

In [31]:
order_products.to_sql("order_products", conn, if_exists="replace", index=False)

conn.commit()
conn.close()

In [32]:
conn = sqlite3.connect(DB_PATH)
pd.read_sql("SELECT COUNT(*) AS n_rows FROM order_products;", conn)

   n_rows
0      30

In [33]:
pd.read_sql("SELECT * FROM order_products LIMIT 5;", conn)

,order_id,user_id,order_date,order_dow,order_hour,product_id,product_name,department,quantity,reordered
0,1,101,2024-01-03,2,10,101,Organic Bananas,Produce,2,0
1,2,102,2024-01-03,2,11,102,Whole Milk,Dairy,1,0
2,3,101,2024-01-05,4,9,101,Organic Bananas,Produce,3,1
3,4,103,2024-01-06,5,14,103,Brown Eggs,Dairy,1,0
4,5,104,2024-01-06,5,16,104,Strawberries,Produce,2,0